# video
* 플래시의 보안 등의 문제로 인해 비디오 태그 탄생
* 웹에서 영상을 볼 수 있게 되며, 유튜브, 넷플릭스와 같은 미디어 플랫폼의 시대로 발전
* 저장되어 있는 비디오 파일만 가능
    * 웹에 있는 콘텐츠 이용 시 iframe 사용
* **속성**
    * **controls** : 재생, 정지 등 조작 메뉴 노출
    * **autoplay** : 동영상 자동 재생
    * **loop** : 동영상 반복 재생
    * **poster** : 동영상 재생 전에 보여 줄 이미지 : *썸네일* (사용자가 이 동영상을 볼지 말지 결정하기 때문에 설정하면 좋음)
    * **preload** : 페이지를 열 때 어떻게 미리 로드할지를 제어
        * **none** : 미리 로딩하지 않음 (페이지 로딩이 좀 더 빨라짐)
        * **metadata** : 미리 로딩하지 않지만 파일의 메타데이터(영상의 길이 등)를 미리 가져옴
        * **auto** : 비디오 파일을 미리 로딩하여 사용자가 바로 영상을 볼 수 있도록 준비
            * 데이터 사용량을 고려해서 사용하는 것이 좋음
    * **src** : 동영상 주소
    * **track** : audio 혹은 video의 자막을 설정할 때 사용
        * **kind** : 텍스트 트랙의 종류를 지정 (subtitles(자막), captions(설명) 등을 지정)
        * **srclang** : 텍스트 트랙의 언어를 지정
        * **label** : 텍스트 트랙의 제목을 지정

# source
* 브라우저가 선택할 수 있는 대체 비디오, 오디오, 이미지 파일을 명시할 수 있도록 해줌
* type : 미디어 유형 지정
    * 타입을 지정하면 트래핑이 적어지기 때문에 지정하는 것이 좋음

# audio
* 웹 페이지에 오디오 컨텐츠를 포함할 때 사용
* 표준 오디오 파일 : *`MP3` `WAV` `Ogg`*
* **audio 태그의 속성**
    * src : 파일의 경로 명시
    * controls : 기본적인 동작을 조절하는 패널 명시
    * autoplay : 자동 재생 여부 명시
        * 웬만하면 지양하기로 하기
        * 필요한 사이트라면 사용 괜춘
    * loop : 반복 재생 여부 명시
    * preload : 파일의 내용을 모두 불러올지 여부 명시
